performance_test/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: performance/todos.k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/40.0s

running (0m02.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 01/10 VUs  02.0s/40.0s

running (0m03.0s), 02/10 VUs, 15 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  03.0s/40.0s

running (0m04.0s), 02/10 VUs, 24 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  04.0s/40.0s

running (0m04.3s), 02/10 VUs, 27 complete and 0 interrupted iterations
default   [  11% ] 02/10 VUs  04.3s/40.0s

running (0m05.0s), 02/10 VUs, 33 complete and 0 interrupted iterations
default   [  12% ] 02/10 VUs  05.0s/40.0s

running (0m06.0s), 03/10 VUs, 47 complete and 0 interrupted iterations
default   [  15% ] 03/10 VUs  06.0s/40.0s

running (0m07.0s), 03/10 VUs, 60 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  07.0s/40.0s

running (0m08.0s), 04/10 VUs, 74 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  08.0s/40.0s

running (0m09.0s), 04/10 VUs, 93 complete and 0 interrupted iterations
default   [  22% ] 04/10 VUs  09.0s/40.0s

running (0m10.0s), 04/10 VUs, 110 complete and 0 interrupted iterations
default   [  25% ] 04/10 VUs  10.0s/40.0s

running (0m11.0s), 05/10 VUs, 130 complete and 0 interrupted iterations
default   [  27% ] 05/10 VUs  11.0s/40.0s

running (0m12.0s), 05/10 VUs, 150 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  12.0s/40.0s

running (0m13.0s), 05/10 VUs, 170 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  13.0s/40.0s

running (0m14.0s), 05/10 VUs, 190 complete and 0 interrupted iterations
default   [  35% ] 05/10 VUs  14.0s/40.0s

running (0m15.0s), 06/10 VUs, 214 complete and 0 interrupted iterations
default   [  37% ] 06/10 VUs  15.0s/40.0s

running (0m16.0s), 06/10 VUs, 238 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  16.0s/40.0s

running (0m17.0s), 06/10 VUs, 262 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  17.0s/40.0s

running (0m18.0s), 06/10 VUs, 286 complete and 0 interrupted iterations
default   [  45% ] 06/10 VUs  18.0s/40.0s

running (0m19.0s), 07/10 VUs, 314 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  19.0s/40.0s

running (0m20.0s), 07/10 VUs, 342 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  20.0s/40.0s

running (0m21.0s), 07/10 VUs, 363 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  21.0s/40.0s

running (0m22.0s), 07/10 VUs, 391 complete and 0 interrupted iterations
default   [  55% ] 07/10 VUs  22.0s/40.0s

running (0m23.0s), 08/10 VUs, 423 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  23.0s/40.0s

running (0m24.0s), 08/10 VUs, 455 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  24.0s/40.0s

running (0m25.0s), 08/10 VUs, 487 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  25.0s/40.0s

running (0m26.0s), 08/10 VUs, 511 complete and 0 interrupted iterations
default   [  65% ] 08/10 VUs  26.0s/40.0s

running (0m27.0s), 09/10 VUs, 547 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  27.0s/40.0s

running (0m28.0s), 09/10 VUs, 583 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  28.0s/40.0s

running (0m29.0s), 09/10 VUs, 619 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  29.0s/40.0s

running (0m30.0s), 09/10 VUs, 646 complete and 0 interrupted iterations
default   [  75% ] 09/10 VUs  30.0s/40.0s

running (0m31.0s), 10/10 VUs, 686 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  31.0s/40.0s

running (0m32.0s), 09/10 VUs, 723 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  32.0s/40.0s

running (0m33.0s), 08/10 VUs, 748 complete and 0 interrupted iterations
default   [  82% ] 08/10 VUs  33.0s/40.0s

running (0m34.0s), 07/10 VUs, 777 complete and 0 interrupted iterations
default   [  85% ] 07/10 VUs  34.0s/40.0s

running (0m35.0s), 06/10 VUs, 802 complete and 0 interrupted iterations
default   [  87% ] 06/10 VUs  35.0s/40.0s

running (0m36.0s), 05/10 VUs, 823 complete and 0 interrupted iterations
default   [  90% ] 05/10 VUs  36.0s/40.0s

running (0m37.0s), 04/10 VUs, 840 complete and 0 interrupted iterations
default   [  92% ] 04/10 VUs  37.0s/40.0s

running (0m38.0s), 03/10 VUs, 853 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  38.0s/40.0s

running (0m39.0s), 02/10 VUs, 862 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  39.0s/40.0s

running (0m40.0s), 01/10 VUs, 868 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=63.34ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1738    43.296889/s
    checks_succeeded...: 100.00% 1738 out of 1738
    checks_failed......: 0.00%   0 out of 1738

    ✓ list status is 200
    ✓ create status is 201

    HTTP
    http_req_duration..............: avg=26.94ms  min=1.02ms   med=23.07ms  max=75.9ms   p(90)=56.91ms  p(95)=63.34ms 
      { expected_response:true }...: avg=26.94ms  min=1.02ms   med=23.07ms  max=75.9ms   p(90)=56.91ms  p(95)=63.34ms 
    http_req_failed................: 0.00%  0 out of 1738
    http_reqs......................: 1738   43.296889/s

    EXECUTION
    iteration_duration.............: avg=254.44ms min=208.09ms med=257.63ms max=279.25ms p(90)=273.52ms p(95)=275.85ms
    iterations.....................: 869    21.648445/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 258 MB 6.4 MB/s
    data_sent......................: 212 kB 5.3 kB/s



running (0m40.1s), 00/10 VUs, 869 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  40s